{
  "Home": "Home",
  "Services": "Services",
  "About": "About",
  "Portfolio": "Portfolio",
  "Contact": "Contact",
  "Skills": "Skills",
  "Download CV": "Download CV",
  "Welcome": "Hi, I’m Mostafa Saeed 👋",
  "description": "I am Mostafa Saeed, a front-end developer specializing in building interactive and modern websites using advanced technologies like Vue.js and React. With practical experience in various projects, I possess a strong ability to solve problems and develop creative solutions to enhance user experience. I am always eager to improve my skills and stay updated with the latest technology trends.",
  "location": "Alexandria, Egypt",
  "title for me": "Mostafa Saeed - Dedicated Front-End Developer Crafting User-Centric Web Solutions",
  "desc for me part-1": "I am Mostafa Saeed, a front-end developer with a strong foundation in creating intuitive and user-friendly web applications. My expertise lies in leveraging modern technologies like Vue.js and React to develop responsive and engaging websites. Over the years, I have worked on a variety of projects, from personal portfolios to complex platforms, each designed to meet specific user needs and business goals.",
  "desc for me part-2": "I take pride in my ability to adapt to new challenges and continuously improve my skill set. Whether working on a solo project or as part of a team, I focus on delivering solutions that are not only functional but also aesthetically pleasing. My approach is rooted in collaboration, listening to client needs, and translating those into practical, elegant web experiences.",
  "desc for me part-3": " I'm always eager to connect with companies and professionals who value innovation and user-centric design in their digital strategies.",
  "desc of skills": "The skills, tools and technologies I am really good at:",
  "developmentSkills": "Development Skills",
  "designSkills": "Design Skills",
  "Experience": "Experience",
  "ExpDescription": "Here is a quick summary of my most recent experiences:",
  "flojicsFirstPoint": "I worked at Flojics Technologies, a software company specializing in delivering innovative digital solutions.",
  "flojicsSecondPoint": "The work environment at Flojics Technologies was both pleasant and beneficial, fostering a supportive and growth-oriented atmosphere.",
  "flojicsThirdPoint": "As a Frontend Developer, I was responsible for converting UI designs into functional websites, ensuring an intuitive and responsive user experience.",
  "flojicsFourthPoint": "One of the notable challenges was integrating a chat feature into a website for the first time using Firebase. This experience significantly enhanced my technical skills and understanding of real-time communication in web applications.",
  "flojicsFifthPoint": "I successfully implemented complex UI designs, improving the overall user engagement and performance of the web applications I worked on.",
  "flojicsSixthPoint": "During my time at Flojics Technologies, I honed my skills in frontend development, particularly in using modern frameworks and real-time database integration, such as Firebase.",
  "freelanceFirstPoint": "Designed and developed front-end websites and applications for various clients using technologies such as Vue.js, Pinia, Vuex, React, Redux, and Tailwind CSS, in addition to HTML, CSS, and JavaScript.",
  "freelanceSecondPoint": "Built interactive and responsive user interfaces, contributing to improved user experience and increased user engagement.",
  "freelanceThirdPoint": "Enhanced website performance through techniques like Code Splitting and Tree Shaking, reducing load times and increasing application efficiency.",
  "Get in touch": "Get in touch",
  "contact desc": "What’s next? Feel free to reach out to me if you're looking for a developer, have a query, or simply want to connect.",
  "text copied": "text copied"
}
